import React from 'react';
import { Col, Container, Row } from "react-bootstrap";
import { i22TT } from "../../../../../../../WebstormProjects/i22TT/AllTranslete";

i22TT.id_component(22,'ru')
{i22TT.get(` сон и сосны \t `,1,10172)}
{ i22TT.get(`Дом`,1,3217) }
{i22TT.get(`Мебель и стены`,1,13060)}
{ i22TT.get(` Паркет `,1,6536) }
{i22TT.get(` сон и сосны \t `,1,10172)}
{i22TT.get(`День и ноч 3`,1,8811)}

function HomePage(props : any) {
	
	i22TT.get(`Дым и  `,1,4410)
	i22TT.get(`Как тут тестить код`,1,17450)
	return (
		<div>
			{i22TT.get(`Привет мир4`,1,9811)}
			<h1>{i22TT.get(`Привет мир64`,1,9866)}</h1>
			{i22TT.get(`Привет мир45`,62,10597)}
			{i22TT.get(`День мир5`,1,7652)}
			<Container>
				<Row>
					<Col>1 of 2</Col>
					<Col>2 of 2</Col>
				</Row>
				<Row>
					<Col>1 of 3</Col>
					<Col>2 of 3</Col>
					<Col>3 of 3</Col>
				</Row>
			</Container>
		</div>
	);
}

export default HomePage;
/*@i22TT_MapTranslate
----------------------
{
  "22": {
    "base_lange": "ru",
    "words": {
      "3217": [
        "Дом",
        1,
        {
          "ru": "Дом",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ],
      "4410": [
        "Дым и  ",
        1,
        {
          "ru": "Дым и  ",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ],
      "6536": [
        " Паркет ",
        1,
        {
          "ru": " Паркет ",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ],
      "7652": [
        "День мир5",
        1,
        {
          "ru": "День мир5",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ],
      "8811": [
        "День и ноч 3",
        1,
        {
          "ru": "День и ноч 3",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ],
      "9811": [
        "Привет мир4",
        1,
        {
          "ru": "Привет мир4",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ],
      "9866": [
        "Привет мир64",
        1,
        {
          "ru": "Привет мир64",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ],
      "10172": [
        " сон и сосны \\t ",
        1,
        {
          "ru": " сон и сосны \\t ",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ],
      "10597": [
        "Привет мир45",
        62,
        {
          "ru": "Привет мир45",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ],
      "13060": [
        "Мебель и стены",
        1,
        {
          "ru": "Мебель и стены",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ],
      "17450": [
        "Как тут тестить код",
        1,
        {
          "ru": "Как тут тестить код",
          "en": "",
          "uk": "",
          "japan": ""
        }
      ]
    }
  }
}
----------------------
@ENDi22TT_MapTranslate*/